In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [23]:
smsdf =  pd.read_csv('./datasets/sms_spamham.csv',encoding='latin1')
smsdf = smsdf[['v1','v2']]
smsdf['res'] = smsdf['v1'].map({'ham':0,'spam':1})
smsdf = smsdf.rename(columns={'v1':'spamham','v2':'text','res':'res'})
smsdf.head()

  spamham                                               text  res
0     ham  Go until jurong point, crazy.. Available only ...    0
1     ham                      Ok lar... Joking wif u oni...    0
2    spam  Free entry in 2 a wkly comp to win FA Cup fina...    1
3     ham  U dun say so early hor... U c already then say...    0
4     ham  Nah I don't think he goes to usf, he lives aro...    0

In [10]:
smsdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

               res
count  5572.000000
mean      0.134063
std       0.340751
min       0.000000
25%       0.000000
50%       0.000000
75%       0.000000
max       1.000000

In [26]:
emaildf = pd.read_csv('./datasets/email_spamham.csv')
emaildf = emaildf[['label','text','label_num']]
emaildf = emaildf.rename(columns={'label':'spamham','text':'text','label_num':'res'})
emaildf.head()

  spamham                                               text  res
0     ham  Subject: enron methanol ; meter # : 988291\r\n...    0
1     ham  Subject: hpl nom for january 9 , 2001\r\n( see...    0
2     ham  Subject: neon retreat\r\nho ho ho , we ' re ar...    0
3    spam  Subject: photoshop , windows , office . cheap ...    1
4     ham  Subject: re : indian springs\r\nthis deal is t...    0

In [11]:
emaildf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5171 entries, 0 to 5170
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5171 non-null   int64
 1   label       5171 non-null   object
 2   text        5171 non-null   object
 3   label_num   5171 non-null   int64
dtypes: int64(2), object(2)
memory usage: 161.7+ KB

In [29]:
spam = pd.concat([emaildf,smsdf])
spam.head()

  spamham                                               text  res
0     ham  Subject: enron methanol ; meter # : 988291\r\n...    0
1     ham  Subject: hpl nom for january 9 , 2001\r\n( see...    0
2     ham  Subject: neon retreat\r\nho ho ho , we ' re ar...    0
3    spam  Subject: photoshop , windows , office . cheap ...    1
4     ham  Subject: re : indian springs\r\nthis deal is t...    0

In [34]:
print(smsdf.shape,emaildf.shape,spam.shape)
#concat success

(5572, 3) (5171, 3) (10743, 3)